#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_network.vpc: Refreshing state... [id=projects/cloudops-388321/global/networks/cloudops-388321-vpc]
google_compute_global_address.default: Refreshing state... [id=projects/cloudops-388321/global/addresses/resume]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume-db]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudops-388321/global/sslCertificates/cloud-resume-cert-managed]
google_service_account.service_account: Refreshing state... [id=projects/cloudops-388321/serviceAccounts/cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_firebase_project.default: Refreshing state... [id=projects/cloudops-388321]
google_project_service.firebase_database: Refreshing state... [id=cloudops-388321/firebasedatabase.googleapis.com]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume-db/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudops-388321/global/backendBuckets/cloud-resume-db-backend-bucket]
google_project_iam_member.cloudrun-invoker: Refreshing state... [id=cloudops-388321/roles/run.invoker/serviceAccount:cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_compute_url_map.default: Refreshing state... [id=projects/cloudops-388321/global/urlMaps/http-lb]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/cloudops-388321/regions/us-central1/subnetworks/cloudops-388321-subnet]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudops-388321/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudops-388321/global/forwardingRules/https-lb-forwarding-rule]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/instances/cloudops-388321-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "cloudops-388321-gke"
      + network                     = "cloudops-388321-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "cloudops-388321-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "cloudops-388321-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cloudops-388321-gke"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "cloudops-388321"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "cloudops-388321-gke",
            ]
          + taint             = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*